import React from "react";
import Faq from "../components/Faq";
import { FaqData } from "../types/FaqData";

const data: FaqData[] = [
  {
    id: "1",
    title: "სათაური 1",
    description: "აღწერა 1",
  },
  {
    id: "2",
    title: "სათაური 2",
    description: "აღწერა 2",
  },
  {
    id: "3",
    title: "სათაური 3",
    description: "აღწერა 3",
  },
  {
    id: "4",
    title: "სათაური 4",
    description: "აღწერა 4",
  },
];

const page = () => {
  return (
    <div>
      <div className="container">
        <div>
          <p className="font-bold" style={{ fontSize: "20px" }}>
            ეროვნული ანტიკრიზისული პლატფორმის მანიფესტი
          </p>
          <br />
          <p>
            საქართველო დგას ისტორიულ გზაგასაყარზე. წლებისა და ათწლეულების
            განმავლობაში დაგროვილმა სისტემურმა პრობლემებმა, ფასადურმა რეფორმებმა
            და პასუხისმგებლობის ნაკლებობამ ქვეყანა მძიმე კრიზისამდე მიიყვანა.
            გასული წლის მოვლენებმა ეს პრობლემები საბოლოოდ გაამწვავა და ნათელი
            გახადა: მხოლოდ დროებითი პოლიტიკური ცვლილებები ვერ იქნება გამოსავალი.
          </p>
          <br />
          <p>
            გვჭირდება სისტემური, ანალიზზე დაფუძნებული, ფართო საზოგადოებრივი
            ლეგიტიმაციით გამყარებული ანტიკრიზისული გეგმა. ამიტომ ვქმნით ეროვნულ
            ანტიკრიზისულ პლატფორმას, რომელიც მიზნად ისახავს საქართველოს
            კრიზისიდან გამოყვანას, ევროპულ გზაზე დაბრუნებას და დემოკრატიული
            განვითარების უზრუნველყოფას.
          </p>
          <br />
          <p className="font-bold" style={{ fontSize: "20px" }}>
            ძირითადი პრინციპები
          </p>
          <br />
          <p>
            მხოლოდ ქვეყნის ინტერესი – არანაირი პარტიული, კომერციული თუ პირადი
            სარგებელი – მხოლოდ საქართველოს უკეთესი მომავალი. პროფესიონალიზმი –
            გადაწყვეტილებების მიღება და პასუხისმგებლობა მხოლოდ კომპეტენციისა და
            გამოცდილების საფუძველზე. კონსესუსი და ნდობა – ადამიანებისა და
            ჯგუფების გაერთიანება, საერთო ინტერესის გარშემო. ინკლუზიურობა – ყველა
            მოქალაქეს აქვს ჩართულობისა და საკუთარი წვლილის შეტანის შესაძლებლობა.
            პასუხისმგებლობა და გამჭვირვალობა – სრული ანგარიშვალდებულება
            საზოგადოებისა და ქვეყნის წინაშე. ევროპული ორიენტაცია – რეფორმებისა
            და პოლიტიკის შემუშავება ევროკავშირის სტანდარტების შესაბამისად.
            სისტემური ანტიკრიზისული ხედვა – პრობლემების არა დროებითი გადაფარვა,
            არამედ ძირეული გადაწყვეტა, რათა ქვეყანა აღარ დაბრუნდეს იგივე
            კრიზისულ წრეში.
          </p>
          <br />
          <p className="font-bold" style={{ fontSize: "20px" }}>
            მიზნები
          </p>
          <br />
          <p>
            1. კრიზისიდან გამოსასვლელი რეალური გზის შექმნა და განხორციელება.
          </p>
          <p>
            2. დემოკრატიული ინსტიტუტების გაძლიერება და საზოგადოების ნდობის
            აღდგენა.
          </p>
          <p>
            3. საქართველოს დაბრუნება ევროპულ და დემოკრატიული განვითარების გზაზე.
          </p>
          <p>
            4. ისეთი პოლიტიკური გარემოს ჩამოყალიბება, სადაც მოქალაქეს აქვს
            რეალური ძალა და აღარ ვიმეორებთ 35-წლიან ჩაკეტილ წრეს.
          </p>
          <br />
          <p className="font-bold" style={{ fontSize: "20px" }}>
            პლატფორმის ხელმომწერები :
          </p>
          <br />
          <p>
            იღებენ ვალდებულებას, პატივს სცემდნენ პლატფორმის პრინციპებსა და
            მიზნებს; არ გამოიყენებენ პლატფორმას პირადი, პარტიული ან კომერციული
            კაპიტალის გასაზრდელად; შეიტანენ საკუთარ წვლილს ანალიზზე, ფაქტებზე და
            პროფესიონალიზმზე დაფუძნებული ხედვის გაძლიერებაში; პატივს სცემენ
            სხვადასხვა ჯგუფების მონაწილეობას და თანამშრომლობას საერთო ეროვნული
            ინტერესისათვის.
          </p>
          <br />
          <p className="font-bold" style={{ fontSize: "20px" }}>
            მოწოდება
          </p>
          <br />
          <p>
            ეს ქვეყანა ჩვენია. მისი მომავალი ჩვენს ხელშია. თუ იზიარებ ზემოთ
            აღნიშნულ ხედვასა და პრინციპებს — გწამს, რომ მხოლოდ პროფესიონალიზმით,
            პატიოსნებით, ერთიანობით და ქვეყნის ინტერესების წინ წამოწევით არის
            შესაძლებელი საქართველოს კრიზისიდან გამოყვანა და ღირსეული მომავლის
            შექმნა — შეუერთდი ეროვნულ ანტიკრიზისულ პლატფორმას და გახდი
            საზოგადოების ისტორიული გადაწყვეტილების ნაწილი.
          </p>
        </div>
        <div style={{ marginTop: "40px" }}>
          <h1 className="font-bold" style={{ fontSize: "42px" }}>
            ხშირად დასმული კითხვები
          </h1>
          <Faq data={data} />
        </div>
      </div>
    </div>
  );
};

export default page;
